# див. server.py in server_client_app

import socket

sock = socket.socket() # creating socket

# Крім цього, ще корисно вказати системі, що якщо застосунок не закрив з'єднання, 
# то потрібно дозволити повторно відкрити тому самому порту. Для цього налаштуємо сокет:
sock.setsockopt(socket.SOL_SOCKET, socket.SO_REUSEADDR, 1)

# скажемо системі, на якому порту та адресі прийматимемо з'єднання.
# Якщо залишити аргумент для адреси порожнім рядком, 
# то сокет буде доступним для всіх інтерфейсів.
sock.bind(("", 9090))

sock.listen(1) # 1 - максимальна кількість підключень у черзі

# accept повертає кортеж із двома елементами: новий сокет та адреса клієнта
conn, addr = sock.accept() 

# Щоб отримати дані, потрібно скористатися методом recv, який як аргумент приймає 
# кількість байт для читання. Ми читатимемо порціями по 1024 байт (або 1 кб).
# Якщо даних більше немає, цей метод нічого не повертає.
while True:
    data = conn.recv(1024)
    if not data:
        break
    conn.send(data.upper())

# закрити з'єднання
conn.close()
